i just hit this myself...is this because the custom hostname binding takes the app service name, vs the app service id?  when a replace happens name isn't marked "dirty" (unlike id which is)

```
# azurerm_function_app.example must be replaced
-/+ resource "azurerm_function_app" "example" {
     ~ client_affinity_enabled        = false -> (known after apply)
     ~ custom_domain_verification_id  = "9681179549E02E1394331A4984A8878B14304AF69EC713FE70C80E510B6134F8" -> (known after apply)
     - daily_memory_time_quota        = 0 -> null
     ~ default_hostname               = "example.azurewebsites.net" -> (known after apply)
       enable_builtin_logging         = true
       enabled                        = true
       https_only                     = false
     ~ id                             = "/subscriptions/<guid>/resourceGroups/<rgroupname>/providers/Microsoft.Web/sites/example" -> (known after apply)
     ~ kind                           = "functionapp" -> (known after apply)
       location                       = "westus"
       name                           = "example"
```

see how name is missing the `~`

if that's the case...i think custom hostname binding should be altered to take the function app id instead of it's name (which is usually a literal in a tf file and never gets dirty unless it's changed).

current workaround is to used depends_on to force the relationship